Revit 2027 API
BuiltInFailures.SketchFailures.NotOneLoop Property
 More than one loop not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotOneLoop { get; }
Public Shared ReadOnly Property NotOneLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotOneLoop {
	FailureDefinitionId^ get ();
}
static member NotOneLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace